RhinoInside.Revit API Documentation
GeometryEncoder.ToCurveArray Method
 Converts the specified Curve to an equivalent Revit CurveArray.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.CurveArray ToCurveArray(
	this Rhino.Geometry.Curve value
)
@staticmethod
def ToCurveArray(
	value: Rhino.Geometry.Curve
) -> Autodesk.Revit.DB.CurveArray
Parameters
value
Type: Rhino.Geometry.Curve
A value to convert.
Return Value
Type: Autodesk.Revit.DB.CurveArray
A Revit CurveArray that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace